Parameter Property
Retrieves a parameter from the element given an identifier.
Overload List
Name | Description
ParameterGuid
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
ParameterBuiltInParameter
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
ParameterDefinition
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
See Also
FamilySymbol Class
FamilySymbol Members
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →